//================================================================================================================
//
// DirectXのエネミー表示用ヘッダファイル [enemy.h]
// Author : TENMA
//
//================================================================================================================
#ifndef _ENEMY_H_
#define _ENEMY_H_

//**********************************************************************************
//*** インクルードファイル ***
//**********************************************************************************
#include "main.h"
#include "input.h"
#include "camera.h"
#include "mathUtil.h"

//**********************************************************************************
//*** マクロ定義 ***
//**********************************************************************************
#define MAX_ENEMY			(32)		// 読み込める敵の総数

//*************************************************************************************************
//*** エネミー構造体の定義 ***
//*************************************************************************************************
typedef struct
{
	D3DXVECTOR3 pos;					// モデルの位置
	D3DXVECTOR3 move;					// モデルの移動量
	D3DXVECTOR3 rot;					// モデルの向き
	D3DXMATRIX mtxWorld;				// ワールドマトリックス
	float fSpd;							// 移動速度
	float fAngle;						// モデルの回転慣性
	float fWidth;						// モデルの幅
	float fHeight;						// モデルの高さ
	float fDepth;						// モデルの奥行
	int nIdShadow;						// 影の番号
	int nType;							// モデル番号
	bool bDisp;							// 描画するか
	bool bUse;							// 使用しているかどうか
}Enemy;

//**********************************************************************************
//*** プロトタイプ宣言 ***
//**********************************************************************************
void InitEnemy(void);
void UninitEnemy(void);
void UpdateEnemy(void);
void DrawEnemy(void);

void SetEnemy(D3DXVECTOR3 pos, D3DXVECTOR3 rot, int nType, float fSpd);
Enemy *GetEnemy(void);
#endif