//================================================================================================================
//
// DirectXのゲームオーバー背景表示処理 [gameoverBg.cpp]
// Author : TENMA
//
//================================================================================================================
//**********************************************************************************
//*** インクルードファイル ***
//**********************************************************************************
#include "gameoverBg.h"

//*************************************************************************************************
//*** マクロ定義 ***
//*************************************************************************************************

//*************************************************************************************************
//*** 弾丸構造体の定義 ***
//*************************************************************************************************
typedef struct
{
	bool bUse;				// 使っているか
	LPDIRECT3DVERTEXBUFFER9 pVtxBuff;	// 頂点バッファのポインタ
	LPDIRECT3DTEXTURE9		pTexture;	// テクスチャのポインタ
}GameOverBg;

//*************************************************************************************************
//*** グローバル変数 ***
//*************************************************************************************************
GameOverBg g_overBg;									// ゲームオーバー背景の情報

//================================================================================================================
// --- ゲームオーバー背景の初期化処理 ---
//================================================================================================================
void InitGameOverBg(void)
{
	/*** デバイスの取得 ***/
	LPDIRECT3DDEVICE9 pDevice = GetDevice();
	GameOverBg* pBg = &g_overBg;
	VERTEX_2D* pVtx;					// 頂点情報へのポインタ

	/*** 各変数の初期化 ***/
	ZeroMemory(&g_overBg, sizeof(GameOverBg));

	/*** テクスチャの読み込み ***/
	D3DXCreateTextureFromFile(pDevice,
		"data\\TEXTURE\\gameoverBg.jpg",
		&pBg->pTexture);

	/*** 頂点バッファの生成 ***/
	pDevice->CreateVertexBuffer(sizeof(VERTEX_2D) * 4,
		D3DUSAGE_WRITEONLY,
		FVF_VERTEX_3D,
		D3DPOOL_MANAGED,
		&pBg->pVtxBuff,
		NULL);

	/*** 頂点バッファの設定 ***/
	pBg->pVtxBuff->Lock(0, 0, (void**)&pVtx, 0);

	/*** 頂点座標の設定の設定 ***/
	SetFullScreenPolygon(pVtx);

	/*** 座標変換用変数の設定 ***/
	pVtx[0].rhw = 1.0f;
	pVtx[1].rhw = 1.0f;
	pVtx[2].rhw = 1.0f;
	pVtx[3].rhw = 1.0f;

	/*** 頂点カラー設定 ***/
	pVtx[0].col = D3DXCOLOR_NULL;
	pVtx[1].col = D3DXCOLOR_NULL;
	pVtx[2].col = D3DXCOLOR_NULL;
	pVtx[3].col = D3DXCOLOR_NULL;

	/*** テクスチャ座標の設定 ***/
	pVtx[0].tex = D3DXVECTOR2(0.0f, 0.0f);
	pVtx[1].tex = D3DXVECTOR2(1.0f, 0.0f);
	pVtx[2].tex = D3DXVECTOR2(0.0f, 1.0f);
	pVtx[3].tex = D3DXVECTOR2(1.0f, 1.0f);

	/*** 頂点バッファの設定を終了 ***/
	pBg->pVtxBuff->Unlock();
}

//================================================================================================================
// --- ゲームオーバー背景の終了処理 ---
//================================================================================================================
void UninitGameOverBg(void)
{
	GameOverBg *pBg = &g_overBg;

	/*** 頂点バッファの破棄 ***/
	RELEASE(pBg->pVtxBuff);

	/*** テクスチャの破棄 ***/
	RELEASE(pBg->pTexture);
}

//================================================================================================================
// --- ゲームオーバー背景の更新処理 ---
//================================================================================================================
void UpdateGameOverBg(void)
{
	
}

//================================================================================================================
// --- ゲームオーバー背景の描画処理 ---
//================================================================================================================
void DrawGameOverBg(void)
{
	/*** デバイスの取得 ***/
	LPDIRECT3DDEVICE9 pDevice = GetDevice();
	GameOverBg *pBg = &g_overBg;

	/*** 頂点バッファをデータストリームに設定 ***/
	pDevice->SetStreamSource(0, pBg->pVtxBuff, 0, sizeof(VERTEX_2D));

	/*** 頂点フォーマットの設定 ***/
	pDevice->SetFVF(FVF_VERTEX_2D);

	/*** テクスチャの設定 ***/
	pDevice->SetTexture(0, pBg->pTexture);

	/*** ポリゴンの描画 ***/
	pDevice->DrawPrimitive(D3DPT_TRIANGLESTRIP,		// プリミティブの種類
		0,											// 描画する最初の頂点インデックス
		2);											// 描画するプリミティブの数
	
}