//================================================================================================================
//
// DirectXのメッシュシリンダー用ヘッダファイル [meshDome.h]
// Author : TENMA
//
//================================================================================================================
#ifndef _MESHDOME_H_
#define _MESHDOME_H_

//**********************************************************************************
//*** インクルードファイル ***
//**********************************************************************************
#include "game.h"

//**********************************************************************************
//*** マクロ定義 ***
//**********************************************************************************

//**********************************************************************************
//*** プロトタイプ宣言 ***
//**********************************************************************************
void InitMeshDome(void);
void UninitMeshDome(void);
void UpdateMeshDome(void);
void DrawMeshDome(void);

int SetMeshDome(D3DXVECTOR3 pos, D3DXVECTOR3 rot, int nXBlock, int nYBlock, float fRadius, D3DCULL type, int nIdxTexture = -1);
//void CollisionMeshDome(D3DXVECTOR3 *pPos, D3DXVECTOR3 *pPosOld, D3DXVECTOR3 *pMove);
#endif