//================================================================================================================
//
// DirectXのランキング用のcppファイル [ranking.cpp]
// Author : TENMA
//
//================================================================================================================
//*************************************************************************************************
//*** インクルードファイル ***
//*************************************************************************************************
#include "ranking.h"
#include "light.h"
#include "fade.h"
#include "rankingScore.h"
#include "cameraRanking.h"
#include "field.h"
#include "object.h"
#include "mesh.h"

//*************************************************************************************************
//*** マクロ定義 ***
//*************************************************************************************************

//*************************************************************************************************
//*** プロトタイプ宣言 ***
//*************************************************************************************************

//*************************************************************************************************
//*** グローバル変数 ***
//*************************************************************************************************
int g_nCounterRanking;

//=================================================================================================
// --- ランキング関連cppファイルの初期化 ---
//=================================================================================================
void InitRanking(void)
{
	g_nCounterRanking = 0;

	/*** aの初期化 ***/

	/*** ランキングの初期化 ***/
	InitRankingScore();;

	/*** 照明の初期化 ***/
	InitLight();

	/*** カメラの初期化 ***/
	InitCameraRanking();

	InitField();

	InitObject();

	InitMeshCylinder();

	/*** ランキングの設定 ***/
	SetRankingScore();

	SetCameraRanking(D3DXVECTOR3(0.0f, 150.0f, 100.0f), D3DXVECTOR3(0.0f, 50.0f, 0.0f), 45.0f, 1.0f, 30000.0f, 300.0f, 1.0f, 0.02f);

	if (FAILED(InitScript("data//SCRIPT//modelRanking.txt")))
	{
		return;
	}

	SetMeshCylinder(VEC_Y(-15000.0f), VECNULL, 30000.0f, 20000.0f, 32, 1, CULLINGTYPE_NONE, 1, false);
}

//=================================================================================================
// --- ランキング関連cppファイルの終了 ---
//=================================================================================================
void UninitRanking(void)
{
	/*** aの終了 ***/

	/*** リザルトスコアの終了 ***/
	UninitRankingScore();

	UninitCameraRanking();

	UninitLight();

	UninitMeshCylinder();

	UninitField();

	UninitObject();
}

//=================================================================================================
// --- ランキング関連cppファイルの更新 ---
//=================================================================================================
void UpdateRanking(void)
{
	/*** aの更新 ***/

	/*** ランキングの更新 ***/
	UpdateCameraRanking();

	UpdateLight();

	UpdateRankingScore();

	UpdateField();

	UpdateMeshCylinder();

	UpdateObject();

	if ((GetKeyboardTrigger(DIK_RETURN)
		|| GetJoypadTrigger(JOYKEY_A)
		|| GetJoypadTrigger(JOYKEY_START))
		&& GetFade() == FADE_NONE)
	{
		SetFade(MODE_TITLE, FADE_TYPE_NORMAL, 120);

		/*** タイトルBGMをフェードイン ***/
		FadeSound(SOUND_LABEL_BGM_TITLE);
	}

	if (g_nCounterRanking >= 600 && GetFade() == FADE_NONE)
	{
		SetFade(MODE_TITLE, FADE_TYPE_NORMAL);

		/*** タイトルBGMをフェードイン ***/
		FadeSound(SOUND_LABEL_BGM_TITLE);
	}

	g_nCounterRanking++;
}

//=================================================================================================
// --- ランキング関連cppファイルの描画 ---
//=================================================================================================
void DrawRanking(void)
{
	/*** aの描画 ***/
	SetCameraRanking();

	// VERTEX_3D ============================================
	DrawMeshCylinder();

	DrawField();

	DrawObject();

	// VERTEX_2D ============================================
	/*** ランキングの描画 ***/
	DrawRankingScore();
}