//================================================================================================================
//
// DirectXのスポットライト処理 [spotlight.cpp]
// Author : TENMA
//
//================================================================================================================
//**********************************************************************************
//*** インクルードファイル ***
//**********************************************************************************
#include "spotlight.h"

//*************************************************************************************************
//*** マクロ定義 ***
//*************************************************************************************************
#define LIGHT_NUM		(1)			// ライトの数

//*************************************************************************************************
//*** グローバル変数 ***
//*************************************************************************************************
D3DLIGHT9 g_aSpotLight[LIGHT_NUM];		// カメラの情報

//================================================================================================================
// --- ライトの初期化 ---
//================================================================================================================
void InitSpotLight(void)
{
	/*** デバイスの取得 ***/
	LPDIRECT3DDEVICE9 pDevice = GetDevice();
	D3DXVECTOR3 vecDir[3];			// ライトの方向ベクトル
	D3DLIGHT9 *pSpotLight = &g_aSpotLight[0];

	/***ライトの情報を初期化 ***/
	ZeroMemory(&g_aSpotLight[0], sizeof(D3DLIGHT9) * LIGHT_NUM);

	/*** ライトの種類を設定 ***/
	pSpotLight->Type = D3DLIGHT_SPOT;

	/*** ライトの拡散光を設定 ***/
	pSpotLight->Diffuse = D3DXCOLOR(1.0f, 1.0f, 1.0f, 1.0f);
	pSpotLight->Specular = D3DXCOLOR(0.5f, 0.5f, 0.5f, 1.0f);
	pSpotLight->Ambient = D3DXCOLOR(0.2f, 0.2f, 0.2f, 1.0f);

	/*** ライトの位置を設定 ***/
	pSpotLight->Position = VECNULL;

	/*** ライトの方向ベクトルを設定 ***/
	pSpotLight->Direction = VEC_Z(1.0f);

	/*** ライトの有効範囲距離を設定 ***/
	pSpotLight->Range = 5000.0f;

	/*** ライトのフォールオフを設定 ***/
	pSpotLight->Falloff = 1.0f;

	/*** ライトの定常減衰係数を設定 ***/
	pSpotLight->Attenuation0 = 1.0f;

	/*** ライトの定常減衰係数を設定 ***/
	pSpotLight->Theta = 0.214f;

	pSpotLight->Phi = 0.57f;

	/*** ライトを設定する ***/
	pDevice->SetLight(0, pSpotLight);

	/*** ライトを有効にする ***/
	pDevice->LightEnable(0, TRUE);
}

//================================================================================================================
// --- ライトの終了 ---
//================================================================================================================
void UninitSpotLight(void)
{

}

//================================================================================================================
// --- ライトの更新 ---
//================================================================================================================
void UpdateSpotLight(void)
{

}

void SetSpotLight(D3DXVECTOR3 pos, D3DXVECTOR3 vec)
{
	/*** デバイスの取得 ***/
	LPDIRECT3DDEVICE9 pDevice = GetDevice();
	D3DLIGHT9* pSpotLight = &g_aSpotLight[0];

	pSpotLight->Position = pos;
	pSpotLight->Direction = vec;

	/*** ライトを設定する ***/
	pDevice->SetLight(0, pSpotLight);
}