//================================================================================================================
//
// DirectXのクリスマスツリー用ヘッダファイル [XmasTree.h]
// Author : TENMA
//
//================================================================================================================
#ifndef _XMASTREE_H_
#define _XMASTREE_H_

//**********************************************************************************
//*** インクルードファイル ***
//**********************************************************************************
#include "game.h"
#include "mesh.h"

//**********************************************************************************
//*** マクロ定義 ***
//**********************************************************************************
#define MAX_COLLISION		(32)		// 木につけられる当たり判定球の最大数

//*************************************************************************************************
//*** クリスマスツリー定義 ***
//*************************************************************************************************
typedef struct
{
	D3DXVECTOR3 pos;					// モデルの位置
	D3DXVECTOR3 rot;					// モデルの向き
	D3DXVECTOR3 rotDest;				// 向きの目標値
	D3DXMATRIX mtxWorld;				// ワールドマトリックス
	float fRadius;						// 木の底面半径
	float fHead;						// 木の頂点
	int nIdShadow;						// 影の番号
	int nType;							// モデル番号
	int aIdxCollision[MAX_COLLISION];	// 球形当たり判定のインデックス
	int nCntXmasTrees;					// くっついているオーナメント数
	bool bDisp;							// 描画するか
	bool bUse;							// 使用しているかどうか
	bool bTop;							// 木のてっぺんにくっついているか
}XmasTree, *PXMASTREE;

//**********************************************************************************
//*** プロトタイプ宣言 ***
//**********************************************************************************
void InitXmasTree(void);
void UninitXmasTree(void);
void UpdateXmasTree(void);
void DrawXmasTree(void);

PXMASTREE GetXmasTree(void);
void SetXmasTree(D3DXVECTOR3 pos, D3DXVECTOR3 rot, int nType);
void PutOrnament(float fAngle, float fWeight);
#endif