//================================================================================================================
//
// DirectXのXファイル読み込み用ヘッダファイル [loadxfile.h]
// Author : TENMA
//
//================================================================================================================
#ifndef _XMODEL_H_
#define _XMODEL_H_

//**********************************************************************************
//*** インクルードファイル ***
//**********************************************************************************
#include "main.h"

//**********************************************************************************
//*** マクロ定義 ***
//**********************************************************************************
#define MAX_XMODEL			(256)			// 読み込めるモデル数
#define MAX_XMTEXTURE		(14)			// 読み込むテクスチャの最大数

//**********************************************************************************
//*** データ保存列挙型 ***
//**********************************************************************************
typedef enum
{
	XMTYPE_TITLE = 0,		// タイトル用
	XMTYPE_GAME,			// ゲーム用
	XMTYPE_RANKING,			// ランキング用
	XMTYPE_MAX
}XMTYPE;

//*************************************************************************************************
//*** モデル情報構造体の定義 ***
//*************************************************************************************************
typedef struct XM_INFO
{
	LPD3DXMESH pMesh;								// メッシュ(頂点情報)へのポインタ
	LPD3DXBUFFER pBuffMat;							// マテリアルへのポインタ
	LPDIRECT3DTEXTURE9 apTexture[MAX_XMTEXTURE];	// テクスチャへのポインタ
	DWORD dwNumMat;									// マテリアルの数
	D3DXVECTOR3 mtxMin;								// オブジェクトの最小値
	D3DXVECTOR3 mtxMax;								// オブジェクトの最大値
	D3DXVECTOR3 mtxXYZ[6];							// 各最大最小値の座標
	D3DXMATRIX mtxWorld;							// ワールドマトリックス
	char aXFileName[MAX_PATH];						// Xファイル名
	bool bUse;										// 一度格納しようとしたか
	bool bSafe;										// 情報が格納されているか(参照可能か)
}XM_INFO;

typedef struct XM_INFO* PXM_INFO, * LPXM_INFO;

//**********************************************************************************
//*** プロトタイプ宣言 ***
//**********************************************************************************
void InitXmodel(void);
void UninitXmodel(void);

HRESULT LoadXmodel(_In_ const char* pXFileName, MODE type);
LPXM_INFO GetXMInfo(_In_ int nType, MODE type);
D3DXVECTOR3 GetXMVector(int nType, int nXYZ, MODE type);
#endif